Комплексная_автоматизация_2_МОМ_2019/src/Reports/ОтражениеЗарплатыВФинансовомУчете/ОтражениеЗарплатыВФинансовомУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтражениеЗарплатыВФинансовомУчете</name>
</mdclass:Report>

Комплексная_автоматизация_2_МОМ_2019/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <comment>АПК:413 История данных важна для отв.лиц. Из-за наличия ОбработкаПолученияДанныхВыбора должна отключаться в потребителях</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраховойНомерПФР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоРождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>240</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетНаучныеТруды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетИзобретения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УточнениеНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Дата регистрации</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСлужебное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛьготаПриНачисленииПособий</name>
    <type>
      <types>EnumRef.ОснованияФинансированияПособияФедеральнымБюджетом</types>
    </type>
  </attributes>
  <attributes>
    <name>ПостоянноПроживалВКрыму18Марта2014Года</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИнициалыИмени</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Инициалы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьСоставСемьи</name>
    <attributes>
      <name>СтепеньРодства</name>
      <type>
        <types>CatalogRef.СтепениРодстваФизическихЛиц</types>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРождения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьОбразование</name>
    <attributes>
      <name>ВидОбразования</name>
      <type>
        <types>CatalogRef.ВидыОбразованияФизическихЛиц</types>
      </type>
    </attributes>
    <attributes>
      <name>УчебноеЗаведение</name>
      <type>
        <types>CatalogRef.УчебныеЗаведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Специальность</name>
      <type>
        <types>CatalogRef.КлассификаторСпециальностейПоОбразованию</types>
      </type>
    </attributes>
    <attributes>
      <name>Диплом</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГодОкончания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьТрудоваяДеятельность</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьЗнаниеЯзыков</name>
    <attributes>
      <name>Язык</name>
      <type>
        <types>CatalogRef.ЯзыкиНародовМира</types>
      </type>
    </attributes>
    <attributes>
      <name>СтепеньЗнанияЯзыка</name>
      <type>
        <types>CatalogRef.СтепениЗнанияЯзыка</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьПрофессии</name>
    <attributes>
      <name>Профессия</name>
      <type>
        <types>CatalogRef.ПрофессииРабочих</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьСтажи</name>
    <attributes>
      <name>ВидСтажа</name>
      <type>
        <types>CatalogRef.ВидыСтажа</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтсчета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазмерМесяцев</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазмерДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьНаграды</name>
    <attributes>
      <name>Награда</name>
      <type>
        <types>CatalogRef.Награды</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПриказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриказа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧейПриказ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьУченыеСтепени</name>
    <attributes>
      <name>УченаяСтепень</name>
      <type>
        <types>CatalogRef.УченыеСтепени</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПрисужденияУченойСтепени</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтрасльНауки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДиссертационныйСовет</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДипломСерияНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДипломВыданОрганизация</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьУченыеЗвания</name>
    <attributes>
      <name>УченоеЗвание</name>
      <type>
        <types>CatalogRef.УченыеЗвания</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПрисвоенияУченогоЗвания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АттестатСерия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АттестатНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АттестатВыданОрганизация</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НаучнаяСпециальность</name>
      <type>
        <types>CatalogRef.КлассификаторСпециальностейПоОбразованию</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Комплексная_автоматизация_2_МОМ_2019/src/Reports/ОтражениеЗарплатыВФинансовомУчете/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем Организация, НачалоПериода, КонецПериода;

#КонецОбласти

#Область ОбработчикиСобытий
	
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПользовательскиеНастройкиМодифицированы = Ложь;
	
	УстановитьОбязательныеНастройки(ПользовательскиеНастройкиМодифицированы);
	
	// Подготовим и выведем отчет.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	
	НастроитьСоставКолонок(НастройкиКомпоновкиДанных);
	
	НаборыДанных = ИнициализироватьВнешнийНаборДанных();
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(
		СхемаКомпоновкиДанных,
		НастройкиКомпоновкиДанных,
		ДанныеРасшифровки);
		
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, НаборыДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.НачатьВывод();
	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	ПроцессорВывода.ЗакончитьВывод();
	
КонецПроцедуры

#КонецОбласти 

#Область СлужбеныеПроцедурыИФункции

// Для общей формы "Форма отчета" подсистемы "Варианты отчетов".
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
КонецПроцедуры

Процедура УстановитьОбязательныеНастройки(ПользовательскиеНастройкиМодифицированы)
	
	Организация = Справочники.Организации.ПустаяСсылка();
	
	ПараметрОрганизация = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Организация");
	Если ПараметрОрганизация <> Неопределено Тогда
		Если ПараметрОрганизация.Использование Тогда
			Организация = ПараметрОрганизация.Значение;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		СтрокаСообщения = НСтр("ru='Не установлено значение параметра ""Организация"".'");
		ВызватьИсключение СтрокаСообщения;
	КонецЕсли;
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	Если ЗначениеПараметра <> Неопределено Тогда
		НачалоПериода = Дата(ЗначениеПараметра.Значение.ДатаНачала);
		КонецПериода  = Дата(ЗначениеПараметра.Значение.ДатаОкончания);
	КонецЕсли;
	
	Если НачалоПериода = '00010101' Тогда
		НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
	Если КонецПериода = '00010101' Тогда
		КонецПериода = КонецМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
	
	Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	ПараметрВалюта = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Валюта");
	Если ПараметрВалюта.Значение <> Валюта Тогда
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Валюта", Валюта);
		ПользовательскиеНастройкиМодифицированы = Истина;
	КонецЕсли;
	
	// Сообщим форме отчета, что настройки модифицированы
	Если ПользовательскиеНастройкиМодифицированы Тогда
		КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПользовательскиеНастройкиМодифицированы", Истина);
	КонецЕсли;
	
КонецПроцедуры

Функция ИнициализироватьВнешнийНаборДанных()
	
	СтрокаСписокТаблиц = "НачисленнаяЗарплатаИВзносы, НачисленныйНДФЛ, УдержаннаяЗарплата, НачисленныеПроцентыПоЗаймам";
	СписокТаблиц = Новый СписокЗначений;
	СписокТаблиц.Добавить("НачисленнаяЗарплатаИВзносы");
	СписокТаблиц.Добавить("НачисленныйНДФЛ");
	СписокТаблиц.Добавить("УдержаннаяЗарплата");
	СписокТаблиц.Добавить("НачисленныеПроцентыПоЗаймам");
	
	ТекущийМесяц = НачалоПериода;
	
	ИнициализацияТаблиц = Истина;
	
	РезультирующаяТаблицаНачислений = Неопределено;
	РезультирующаяТаблицаНДФЛ       = Неопределено;
	РезультирующаяТаблицаУдержаний  = Неопределено;
	РезультирующаяТаблицаПроцентов  = Неопределено;
	
	Пока ТекущийМесяц <= НачалоМесяца(КонецПериода) Цикл
		
		СтруктураПараметров = ОтражениеЗарплатыВБухучетеРасширенный.ПараметрыДляЗаполненияТаблицДокумента();
		СтруктураПараметров.Организация 		= Организация;
		СтруктураПараметров.ПериодРегистрации 	= ТекущийМесяц;
		
		СтруктураПараметров.Вставить("СтрокаСписокТаблиц", СтрокаСписокТаблиц);
		
		АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено);
		
		Документы.ОтражениеЗарплатыВФинансовомУчете.ПодготовитьДанныеДляЗаполнения(СтруктураПараметров, АдресХранилища);
		
		Параметры = Новый Структура;
		Параметры.Вставить("АдресХранилища",          АдресХранилища);
		Параметры.Вставить("СтрокаСписокТаблиц",      СтрокаСписокТаблиц);
		Параметры.Вставить("СписокТаблиц",            СписокТаблиц);
		Параметры.Вставить("ЗаполнятьАналитики",      Ложь);
		Параметры.Вставить("ТекстОповещения",         );
		Параметры.Вставить("ПояснениеОповещения",     );
		Параметры.Вставить("ЕстьДанныеДляЗаполнения", Ложь);
		Параметры.Вставить("Сводно",                  Ложь);
		
		Результат = ТаблицыОтражения();
		
		Документы.ОтражениеЗарплатыВФинансовомУчете.ЗаполнениеПослеВыполненияДлительнойОперации(Результат, Параметры, Ложь);
		
		Если ИнициализацияТаблиц Тогда
			
			РезультирующаяТаблицаНачислений     = Результат.НачисленнаяЗарплатаИВзносыПоФизлицам;
			РезультирующаяТаблицаНДФЛ           = Результат.НачисленныйНДФЛ;
			РезультирующаяТаблицаУдержаний      = Результат.УдержаннаяЗарплата;
			РезультирующаяТаблицаПроцентов      = Результат.НачисленныеПроцентыПоЗаймам;
			
			ИнициализацияТаблиц = Ложь;
			
		Иначе
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Результат.НачисленнаяЗарплатаИВзносыПоФизлицам,   РезультирующаяТаблицаНачислений);
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Результат.НачисленныйНДФЛ,       РезультирующаяТаблицаНДФЛ);
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Результат.УдержаннаяЗарплата,    РезультирующаяТаблицаУдержаний);
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Результат.НачисленныеПроцентыПоЗаймам,    РезультирующаяТаблицаПроцентов);
		КонецЕсли;
		
		ТекущийМесяц = ДобавитьМесяц(ТекущийМесяц, 1);
		
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Документы.Ссылка КАК Ссылка,
		|	Документы.Сводно КАК Сводно,
		|	Документы.Организация
		|ПОМЕСТИТЬ ВТДокументы
		|ИЗ
		|	Документ.ОтражениеЗарплатыВФинансовомУчете КАК Документы
		|ГДЕ
		|	Документы.Проведен
		|	И Документы.ПериодРегистрации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Документы.Организация = &Организация
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Организация,
		|	НачисленнаяЗарплата.ОблагаетсяЕНВД,
		|	НачисленнаяЗарплата.ПодразделениеПредприятия,
		|	НачисленнаяЗарплата.СпособОтраженияЗарплатыВБухучете,
		|	НачисленнаяЗарплата.ФизическоеЛицо,
		|	НачисленнаяЗарплата.ВидОперации,
		|	НачисленнаяЗарплата.Сумма,
		|	НачисленнаяЗарплата.ПФРСтраховая,
		|	НачисленнаяЗарплата.ПФРНакопительная,
		|	НачисленнаяЗарплата.ПФРДоПредельнойВеличины,
		|	НачисленнаяЗарплата.ПФРСПревышения,
		|	НачисленнаяЗарплата.ПФРНаДоплатуЛетчикам,
		|	НачисленнаяЗарплата.ПФРНаДоплатуШахтерам,
		|	НачисленнаяЗарплата.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
		|	НачисленнаяЗарплата.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
		|	НачисленнаяЗарплата.ФСС,
		|	НачисленнаяЗарплата.ФФОМС,
		|	НачисленнаяЗарплата.ТФОМС,
		|	НачисленнаяЗарплата.ФССНесчастныеСлучаи,
		|	0 КАК СуммаОтражено,
		|	0 КАК ПФРСтраховаяОтражено,
		|	0 КАК ПФРНакопительнаяОтражено,
		|	0 КАК ПФРДоПредельнойВеличиныОтражено,
		|	0 КАК ПФРСПревышенияОтражено,
		|	0 КАК ПФРНаДоплатуЛетчикамОтражено,
		|	0 КАК ПФРНаДоплатуШахтерамОтражено,
		|	0 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОтражено,
		|	0 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОтражено,
		|	0 КАК ФССОтражено,
		|	0 КАК ФФОМСОтражено,
		|	0 КАК ТФОМСОтражено,
		|	0 КАК ФССНесчастныеСлучаиОтражено
		|ПОМЕСТИТЬ ВТНачислено
		|ИЗ
		|	&НачисленнаяЗарплата КАК НачисленнаяЗарплата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачисленныйНДФЛ.ПодразделениеПредприятия,
		|	НачисленныйНДФЛ.ВидОперации,
		|	НачисленныйНДФЛ.ФизическоеЛицо,
		|	НачисленныйНДФЛ.РегистрацияВНалоговомОргане,
		|	НачисленныйНДФЛ.Сумма КАК НДФЛНачислено,
		|	0 КАК НДФЛОтражено
		|ПОМЕСТИТЬ ВТНДФЛ
		|ИЗ
		|	&НачисленныйНДФЛ КАК НачисленныйНДФЛ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачисленныеПроцентыПоЗаймам.ПодразделениеПредприятия,
		|	НачисленныеПроцентыПоЗаймам.ФизическоеЛицо,
		|	НачисленныеПроцентыПоЗаймам.Сумма КАК ПроцентыНачислено,
		|	0 КАК ПроцентыОтражено
		|ПОМЕСТИТЬ ВТПроценты
		|ИЗ
		|	&НачисленныеПроцентыПоЗаймам КАК НачисленныеПроцентыПоЗаймам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УдержаннаяЗарплата.ПодразделениеПредприятия,
		|	УдержаннаяЗарплата.ВидОперации,
		|	УдержаннаяЗарплата.ФизическоеЛицо,
		|	УдержаннаяЗарплата.Контрагент,
		|	УдержаннаяЗарплата.Сумма КАК УдержанияНачислено,
		|	0 КАК УдержанияОтражено
		|ПОМЕСТИТЬ ВТУдержания
		|ИЗ
		|	&УдержаннаяЗарплата КАК УдержаннаяЗарплата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДокументы.Организация,
		|	НачисленияПоФизлицам.ПодразделениеПредприятия,
		|	НачисленияПоФизлицам.ФизическоеЛицо,
		|	НачисленияПоФизлицам.ВидОперации,
		|	НачисленияПоФизлицам.СпособОтраженияЗарплатыВБухучете,
		|	НачисленияПоФизлицам.ОблагаетсяЕНВД,
		|	НачисленияПоФизлицам.Сумма КАК СуммаОтражено,
		|	НачисленияПоФизлицам.ПФРСтраховая КАК ПФРСтраховаяОтражено,
		|	НачисленияПоФизлицам.ПФРНакопительная КАК ПФРНакопительнаяОтражено,
		|	НачисленияПоФизлицам.ПФРДоПредельнойВеличины КАК ПФРДоПредельнойВеличиныОтражено,
		|	НачисленияПоФизлицам.ПФРСПревышения КАК ПФРСПревышенияОтражено,
		|	НачисленияПоФизлицам.ПФРНаДоплатуЛетчикам КАК ПФРНаДоплатуЛетчикамОтражено,
		|	НачисленияПоФизлицам.ПФРНаДоплатуШахтерам КАК ПФРНаДоплатуШахтерамОтражено,
		|	НачисленияПоФизлицам.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОтражено,
		|	НачисленияПоФизлицам.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОтражено,
		|	НачисленияПоФизлицам.ФСС КАК ФССОтражено,
		|	НачисленияПоФизлицам.ФФОМС КАК ФФОМСОтражено,
		|	НачисленияПоФизлицам.ТФОМС КАК ТФОМСОтражено,
		|	НачисленияПоФизлицам.ФССНесчастныеСлучаи КАК ФССНесчастныеСлучаиОтражено,
		|	0 КАК Сумма,
		|	0 КАК ПФРСтраховая,
		|	0 КАК ПФРНакопительная,
		|	0 КАК ПФРДоПредельнойВеличины,
		|	0 КАК ПФРСПревышения,
		|	0 КАК ПФРНаДоплатуЛетчикам,
		|	0 КАК ПФРНаДоплатуШахтерам,
		|	0 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
		|	0 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
		|	0 КАК ФСС,
		|	0 КАК ФФОМС,
		|	0 КАК ТФОМС,
		|	0 КАК ФССНесчастныеСлучаи
		|ПОМЕСТИТЬ ВТОтражено
		|ИЗ
		|	ВТДокументы КАК ВТДокументы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтражениеЗарплатыВФинансовомУчете.НачисленнаяЗарплатаИВзносыПоФизлицам КАК НачисленияПоФизлицам
		|		ПО ВТДокументы.Ссылка = НачисленияПоФизлицам.Ссылка
		|ГДЕ
		|	НЕ ВТДокументы.Сводно
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТДокументы.Организация,
		|	НачисленияСводно.ПодразделениеПредприятия,
		|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка),
		|	НачисленияСводно.ВидОперации,
		|	НачисленияСводно.СпособОтраженияЗарплатыВБухучете,
		|	НачисленияСводно.ОблагаетсяЕНВД,
		|	НачисленияСводно.Сумма,
		|	НачисленияСводно.ПФРСтраховая,
		|	НачисленияСводно.ПФРНакопительная,
		|	НачисленияСводно.ПФРДоПредельнойВеличины,
		|	НачисленияСводно.ПФРСПревышения,
		|	НачисленияСводно.ПФРНаДоплатуЛетчикам,
		|	НачисленияСводно.ПФРНаДоплатуШахтерам,
		|	НачисленияСводно.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
		|	НачисленияСводно.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
		|	НачисленияСводно.ФСС,
		|	НачисленияСводно.ФФОМС,
		|	НачисленияСводно.ТФОМС,
		|	НачисленияСводно.ФССНесчастныеСлучаи,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0
		|ИЗ
		|	ВТДокументы КАК ВТДокументы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтражениеЗарплатыВФинансовомУчете.НачисленнаяЗарплатаИВзносы КАК НачисленияСводно
		|		ПО ВТДокументы.Ссылка = НачисленияСводно.Ссылка
		|ГДЕ
		|	ВТДокументы.Сводно
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТНачислено.Организация,
		|	ВТНачислено.ОблагаетсяЕНВД,
		|	ВТНачислено.ПодразделениеПредприятия,
		|	ВТНачислено.СпособОтраженияЗарплатыВБухучете,
		|	ВТНачислено.ФизическоеЛицо,
		|	ВТНачислено.ВидОперации,
		|	ВТНачислено.Сумма,
		|	ВТНачислено.ПФРСтраховая,
		|	ВТНачислено.ПФРНакопительная,
		|	ВТНачислено.ПФРДоПредельнойВеличины,
		|	ВТНачислено.ПФРСПревышения,
		|	ВТНачислено.ПФРНаДоплатуЛетчикам,
		|	ВТНачислено.ПФРНаДоплатуШахтерам,
		|	ВТНачислено.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
		|	ВТНачислено.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
		|	ВТНачислено.ФСС,
		|	ВТНачислено.ФССНесчастныеСлучаи,
		|	ВТНачислено.ФФОМС,
		|	ВТНачислено.ТФОМС,
		|	ВТНачислено.СуммаОтражено,
		|	ВТНачислено.ПФРСтраховаяОтражено,
		|	ВТНачислено.ПФРНакопительнаяОтражено,
		|	ВТНачислено.ПФРДоПредельнойВеличиныОтражено,
		|	ВТНачислено.ПФРСПревышенияОтражено,
		|	ВТНачислено.ПФРНаДоплатуЛетчикамОтражено,
		|	ВТНачислено.ПФРНаДоплатуШахтерамОтражено,
		|	ВТНачислено.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОтражено,
		|	ВТНачислено.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОтражено,
		|	ВТНачислено.ФССОтражено,
		|	ВТНачислено.ФССНесчастныеСлучаиОтражено,
		|	ВТНачислено.ФФОМСОтражено,
		|	ВТНачислено.ТФОМСОтражено
		|ПОМЕСТИТЬ ВТНачисленнаяЗарплата
		|ИЗ
		|	ВТНачислено КАК ВТНачислено
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТОтражено.Организация,
		|	ВТОтражено.ОблагаетсяЕНВД,
		|	ВТОтражено.ПодразделениеПредприятия,
		|	ВТОтражено.СпособОтраженияЗарплатыВБухучете,
		|	ВТОтражено.ФизическоеЛицо,
		|	ВТОтражено.ВидОперации,
		|	ВТОтражено.Сумма,
		|	ВТОтражено.ПФРСтраховая,
		|	ВТОтражено.ПФРНакопительная,
		|	ВТОтражено.ПФРДоПредельнойВеличины,
		|	ВТОтражено.ПФРСПревышения,
		|	ВТОтражено.ПФРНаДоплатуЛетчикам,
		|	ВТОтражено.ПФРНаДоплатуШахтерам,
		|	ВТОтражено.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
		|	ВТОтражено.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
		|	ВТОтражено.ФСС,
		|	ВТОтражено.ФССНесчастныеСлучаи,
		|	ВТОтражено.ФФОМС,
		|	ВТОтражено.ТФОМС,
		|	ВТОтражено.СуммаОтражено,
		|	ВТОтражено.ПФРСтраховаяОтражено,
		|	ВТОтражено.ПФРНакопительнаяОтражено,
		|	ВТОтражено.ПФРДоПредельнойВеличиныОтражено,
		|	ВТОтражено.ПФРСПревышенияОтражено,
		|	ВТОтражено.ПФРНаДоплатуЛетчикамОтражено,
		|	ВТОтражено.ПФРНаДоплатуШахтерамОтражено,
		|	ВТОтражено.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОтражено,
		|	ВТОтражено.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОтражено,
		|	ВТОтражено.ФССОтражено,
		|	ВТОтражено.ФССНесчастныеСлучаиОтражено,
		|	ВТОтражено.ФФОМСОтражено,
		|	ВТОтражено.ТФОМСОтражено
		|ИЗ
		|	ВТОтражено КАК ВТОтражено
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТНДФЛ.ПодразделениеПредприятия,
		|	ВТНДФЛ.ВидОперации,
		|	ВТНДФЛ.ФизическоеЛицо,
		|	ВТНДФЛ.РегистрацияВНалоговомОргане,
		|	ВТНДФЛ.НДФЛНачислено,
		|	ВТНДФЛ.НДФЛОтражено
		|ПОМЕСТИТЬ ВТНДФЛОбъединение
		|ИЗ
		|	ВТНДФЛ КАК ВТНДФЛ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОтраженныйНДФЛ.ПодразделениеПредприятия,
		|	ОтраженныйНДФЛ.ВидОперации,
		|	ОтраженныйНДФЛ.ФизическоеЛицо,
		|	ОтраженныйНДФЛ.РегистрацияВНалоговомОргане,
		|	0,
		|	ОтраженныйНДФЛ.Сумма
		|ИЗ
		|	Документ.ОтражениеЗарплатыВФинансовомУчете.НачисленныйНДФЛ КАК ОтраженныйНДФЛ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументы КАК ВТДокументы
		|		ПО ОтраженныйНДФЛ.Ссылка = ВТДокументы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПроценты.ПодразделениеПредприятия,
		|	ВТПроценты.ФизическоеЛицо,
		|	ВТПроценты.ПроцентыНачислено,
		|	ВТПроценты.ПроцентыОтражено
		|ПОМЕСТИТЬ ВТПроцентыОбъединение
		|ИЗ
		|	ВТПроценты КАК ВТПроценты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОтражениеЗарплатыВФинансовомУчетеНачисленныеПроцентыПоЗаймам.ПодразделениеПредприятия,
		|	ОтражениеЗарплатыВФинансовомУчетеНачисленныеПроцентыПоЗаймам.ФизическоеЛицо,
		|	0,
		|	ОтражениеЗарплатыВФинансовомУчетеНачисленныеПроцентыПоЗаймам.Сумма
		|ИЗ
		|	Документ.ОтражениеЗарплатыВФинансовомУчете.НачисленныеПроцентыПоЗаймам КАК ОтражениеЗарплатыВФинансовомУчетеНачисленныеПроцентыПоЗаймам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументы КАК ВТДокументы
		|		ПО ОтражениеЗарплатыВФинансовомУчетеНачисленныеПроцентыПоЗаймам.Ссылка = ВТДокументы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТУдержания.ПодразделениеПредприятия,
		|	ВТУдержания.ВидОперации,
		|	ВТУдержания.ФизическоеЛицо,
		|	ВТУдержания.Контрагент,
		|	ВТУдержания.УдержанияНачислено,
		|	ВТУдержания.УдержанияОтражено
		|ПОМЕСТИТЬ ВТУдержанияОбъединение
		|ИЗ
		|	ВТУдержания КАК ВТУдержания
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УдержаннаяЗарплатаПритянаяКУчету.ПодразделениеПредприятия,
		|	УдержаннаяЗарплатаПритянаяКУчету.ВидОперации,
		|	УдержаннаяЗарплатаПритянаяКУчету.ФизическоеЛицо,
		|	УдержаннаяЗарплатаПритянаяКУчету.Контрагент,
		|	0,
		|	УдержаннаяЗарплатаПритянаяКУчету.Сумма
		|ИЗ
		|	Документ.ОтражениеЗарплатыВФинансовомУчете.УдержаннаяЗарплата КАК УдержаннаяЗарплатаПритянаяКУчету
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументы КАК ВТДокументы
		|		ПО УдержаннаяЗарплатаПритянаяКУчету.Ссылка = ВТДокументы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТНачисленнаяЗарплата.Организация,
		|	ВТНачисленнаяЗарплата.ОблагаетсяЕНВД,
		|	ВТНачисленнаяЗарплата.ПодразделениеПредприятия,
		|	ВТНачисленнаяЗарплата.СпособОтраженияЗарплатыВБухучете,
		|	ВТНачисленнаяЗарплата.ФизическоеЛицо,
		|	ВТНачисленнаяЗарплата.ВидОперации,
		|	СУММА(ВТНачисленнаяЗарплата.Сумма) КАК Сумма,
		|	СУММА(ВТНачисленнаяЗарплата.ПФРСтраховая) КАК ПФРСтраховая,
		|	СУММА(ВТНачисленнаяЗарплата.ПФРНакопительная) КАК ПФРНакопительная,
		|	СУММА(ВТНачисленнаяЗарплата.ПФРДоПредельнойВеличины) КАК ПФРДоПредельнойВеличины,
		|	СУММА(ВТНачисленнаяЗарплата.ПФРСПревышения) КАК ПФРСПревышения,
		|	СУММА(ВТНачисленнаяЗарплата.ПФРНаДоплатуЛетчикам) КАК ПФРНаДоплатуЛетчикам,
		|	СУММА(ВТНачисленнаяЗарплата.ПФРНаДоплатуШахтерам) КАК ПФРНаДоплатуШахтерам,
		|	СУММА(ВТНачисленнаяЗарплата.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
		|	СУММА(ВТНачисленнаяЗарплата.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
		|	СУММА(ВТНачисленнаяЗарплата.ФСС) КАК ФСС,
		|	СУММА(ВТНачисленнаяЗарплата.ФССНесчастныеСлучаи) КАК ФССНесчастныеСлучаи,
		|	СУММА(ВТНачисленнаяЗарплата.ФФОМС) КАК ФФОМС,
		|	СУММА(ВТНачисленнаяЗарплата.ТФОМС) КАК ТФОМС,
		|	СУММА(ВТНачисленнаяЗарплата.СуммаОтражено) КАК СуммаОтражено,
		|	СУММА(ВТНачисленнаяЗарплата.ПФРСтраховаяОтражено) КАК ПФРСтраховаяОтражено,
		|	СУММА(ВТНачисленнаяЗарплата.ПФРНакопительнаяОтражено) КАК ПФРНакопительнаяОтражено,
		|	СУММА(ВТНачисленнаяЗарплата.ПФРДоПредельнойВеличиныОтражено) КАК ПФРДоПредельнойВеличиныОтражено,
		|	СУММА(ВТНачисленнаяЗарплата.ПФРСПревышенияОтражено) КАК ПФРСПревышенияОтражено,
		|	СУММА(ВТНачисленнаяЗарплата.ПФРНаДоплатуЛетчикамОтражено) КАК ПФРНаДоплатуЛетчикамОтражено,
		|	СУММА(ВТНачисленнаяЗарплата.ПФРНаДоплатуШахтерамОтражено) КАК ПФРНаДоплатуШахтерамОтражено,
		|	СУММА(ВТНачисленнаяЗарплата.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОтражено) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОтражено,
		|	СУММА(ВТНачисленнаяЗарплата.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОтражено) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОтражено,
		|	СУММА(ВТНачисленнаяЗарплата.ФССОтражено) КАК ФССОтражено,
		|	СУММА(ВТНачисленнаяЗарплата.ФССНесчастныеСлучаиОтражено) КАК ФССНесчастныеСлучаиОтражено,
		|	СУММА(ВТНачисленнаяЗарплата.ФФОМСОтражено) КАК ФФОМСОтражено,
		|	СУММА(ВТНачисленнаяЗарплата.ТФОМСОтражено) КАК ТФОМСОтражено,
		|	ВЫБОР
		|		КОГДА СУММА(ВТНачисленнаяЗарплата.Сумма) - СУММА(ВТНачисленнаяЗарплата.СуммаОтражено) + СУММА(ВТНачисленнаяЗарплата.ПФРСтраховая) - СУММА(ВТНачисленнаяЗарплата.ПФРСтраховаяОтражено) + СУММА(ВТНачисленнаяЗарплата.ПФРНакопительная) - СУММА(ВТНачисленнаяЗарплата.ПФРНакопительнаяОтражено) + СУММА(ВТНачисленнаяЗарплата.ПФРДоПредельнойВеличины) - СУММА(ВТНачисленнаяЗарплата.ПФРДоПредельнойВеличиныОтражено) + СУММА(ВТНачисленнаяЗарплата.ПФРСПревышения) - СУММА(ВТНачисленнаяЗарплата.ПФРСПревышенияОтражено) +СУММА(ВТНачисленнаяЗарплата.ПФРНаДоплатуЛетчикам) - СУММА(ВТНачисленнаяЗарплата.ПФРНаДоплатуЛетчикамОтражено) + СУММА(ВТНачисленнаяЗарплата.ПФРНаДоплатуШахтерам) - СУММА(ВТНачисленнаяЗарплата.ПФРНаДоплатуШахтерамОтражено) + СУММА(ВТНачисленнаяЗарплата.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах) - СУММА(ВТНачисленнаяЗарплата.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОтражено) + СУММА(ВТНачисленнаяЗарплата.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах) - СУММА(ВТНачисленнаяЗарплата.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОтражено) + СУММА(ВТНачисленнаяЗарплата.ФСС) - СУММА(ВТНачисленнаяЗарплата.ФССОтражено) + СУММА(ВТНачисленнаяЗарплата.ФССНесчастныеСлучаи) - СУММА(ВТНачисленнаяЗарплата.ФССНесчастныеСлучаиОтражено) + СУММА(ВТНачисленнаяЗарплата.ФФОМС) - СУММА(ВТНачисленнаяЗарплата.ФФОМСОтражено) + СУММА(ВТНачисленнаяЗарплата.ТФОМС) - СУММА(ВТНачисленнаяЗарплата.ТФОМСОтражено) <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ТребуетсяОтражение,
		|	""НачисленнаяЗарплата"" КАК ИдентификаторНабора
		|ИЗ
		|	ВТНачисленнаяЗарплата КАК ВТНачисленнаяЗарплата
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТНачисленнаяЗарплата.ПодразделениеПредприятия,
		|	ВТНачисленнаяЗарплата.ФизическоеЛицо,
		|	ВТНачисленнаяЗарплата.ОблагаетсяЕНВД,
		|	ВТНачисленнаяЗарплата.СпособОтраженияЗарплатыВБухучете,
		|	ВТНачисленнаяЗарплата.ВидОперации,
		|	ВТНачисленнаяЗарплата.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТНДФЛОбъединение.ПодразделениеПредприятия,
		|	ВТНДФЛОбъединение.ВидОперации,
		|	ВТНДФЛОбъединение.ФизическоеЛицо,
		|	ВТНДФЛОбъединение.РегистрацияВНалоговомОргане,
		|	СУММА(ВТНДФЛОбъединение.НДФЛНачислено) КАК НДФЛНачислено,
		|	СУММА(ВТНДФЛОбъединение.НДФЛОтражено) КАК НДФЛОтражено,
		|	ВЫБОР
		|		КОГДА СУММА(ВТНДФЛОбъединение.НДФЛНачислено) - СУММА(ВТНДФЛОбъединение.НДФЛОтражено) <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ТребуетсяОтражение,
		|	&Организация,
		|	""НачисленныйНДФЛ"" КАК ИдентификаторНабора
		|ИЗ
		|	ВТНДФЛОбъединение КАК ВТНДФЛОбъединение
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТНДФЛОбъединение.ФизическоеЛицо,
		|	ВТНДФЛОбъединение.РегистрацияВНалоговомОргане,
		|	ВТНДФЛОбъединение.ПодразделениеПредприятия,
		|	ВТНДФЛОбъединение.ВидОперации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТУдержанияОбъединение.ПодразделениеПредприятия,
		|	ВТУдержанияОбъединение.ВидОперации,
		|	ВТУдержанияОбъединение.ФизическоеЛицо,
		|	ВТУдержанияОбъединение.Контрагент,
		|	СУММА(ВТУдержанияОбъединение.УдержанияНачислено) КАК УдержанияНачислено,
		|	СУММА(ВТУдержанияОбъединение.УдержанияОтражено) КАК УдержанияОтражено,
		|	ВЫБОР
		|		КОГДА СУММА(ВТУдержанияОбъединение.УдержанияНачислено) - СУММА(ВТУдержанияОбъединение.УдержанияОтражено) <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ТребуетсяОтражение,
		|	&Организация,
		|	""УдержаннаяЗарплата"" КАК ИдентификаторНабора
		|ИЗ
		|	ВТУдержанияОбъединение КАК ВТУдержанияОбъединение
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТУдержанияОбъединение.ВидОперации,
		|	ВТУдержанияОбъединение.ПодразделениеПредприятия,
		|	ВТУдержанияОбъединение.ФизическоеЛицо,
		|	ВТУдержанияОбъединение.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПроцентыОбъединение.ПодразделениеПредприятия,
		|	ВТПроцентыОбъединение.ФизическоеЛицо,
		|	&Организация,
		|	""НачисленныеПроцентыПоЗаймам"" КАК ИдентификаторНабора,
		|	СУММА(ВТПроцентыОбъединение.ПроцентыНачислено) КАК ПроцентыНачислено,
		|	СУММА(ВТПроцентыОбъединение.ПроцентыОтражено) КАК ПроцентыОтражено,
		|	ВЫБОР
		|		КОГДА СУММА(ВТПроцентыОбъединение.ПроцентыНачислено) - СУММА(ВТПроцентыОбъединение.ПроцентыОтражено) <> 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ТребуетсяОтражение
		|ИЗ
		|	ВТПроцентыОбъединение КАК ВТПроцентыОбъединение
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТПроцентыОбъединение.ФизическоеЛицо,
		|	ВТПроцентыОбъединение.ПодразделениеПредприятия";
		
	Запрос.УстановитьПараметр("НачисленнаяЗарплата",   РезультирующаяТаблицаНачислений);
	Запрос.УстановитьПараметр("НачисленныйНДФЛ",       РезультирующаяТаблицаНДФЛ);
	Запрос.УстановитьПараметр("УдержаннаяЗарплата",    РезультирующаяТаблицаУдержаний);
	Запрос.УстановитьПараметр("НачисленныеПроцентыПоЗаймам",    РезультирующаяТаблицаПроцентов);
	Запрос.УстановитьПараметр("Организация",           Организация);
	Запрос.УстановитьПараметр("НачалоПериода",         НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",          КонецПериода);
	
	Результат = Запрос.ВыполнитьПакет();
	
	НаборыДанных = Новый Структура;
	НаборыДанных.Вставить("НачисленнаяЗарплата", Результат[10].Выгрузить());
	НаборыДанных.Вставить("НачисленныйНДФЛ",     Результат[11].Выгрузить());
	НаборыДанных.Вставить("УдержаннаяЗарплата",  Результат[12].Выгрузить());
	НаборыДанных.Вставить("НачисленныеПроцентыПоЗаймам",  Результат[13].Выгрузить());
	
	Возврат НаборыДанных;
	
КонецФункции

Функция ТаблицыОтражения()
	
	НачисленнаяЗарплатаИВзносы = Новый ТаблицаЗначений;
	Реквизиты = Метаданные.Документы.ОтражениеЗарплатыВФинансовомУчете.ТабличныеЧасти.НачисленнаяЗарплатаИВзносы.Реквизиты;
	Для Каждого Реквизит Из Реквизиты Цикл
		НачисленнаяЗарплатаИВзносы.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип);
	КонецЦикла;
	
	НачисленнаяЗарплатаИВзносыПоФизлицам = Новый ТаблицаЗначений;
	Реквизиты = Метаданные.Документы.ОтражениеЗарплатыВФинансовомУчете.ТабличныеЧасти.НачисленнаяЗарплатаИВзносыПоФизлицам.Реквизиты;
	Для Каждого Реквизит Из Реквизиты Цикл
		НачисленнаяЗарплатаИВзносыПоФизлицам.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип);
	КонецЦикла;
	
	НачисленныйНДФЛ = Новый ТаблицаЗначений;
	Реквизиты = Метаданные.Документы.ОтражениеЗарплатыВФинансовомУчете.ТабличныеЧасти.НачисленныйНДФЛ.Реквизиты;
	Для Каждого Реквизит Из Реквизиты Цикл
		НачисленныйНДФЛ.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип);
	КонецЦикла;
	
	УдержаннаяЗарплата = Новый ТаблицаЗначений;
	Реквизиты = Метаданные.Документы.ОтражениеЗарплатыВФинансовомУчете.ТабличныеЧасти.УдержаннаяЗарплата.Реквизиты;
	Для Каждого Реквизит Из Реквизиты Цикл
		УдержаннаяЗарплата.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип);
	КонецЦикла;
	
	НачисленныеПроцентыПоЗаймам = Новый ТаблицаЗначений;
	Реквизиты = Метаданные.Документы.ОтражениеЗарплатыВФинансовомУчете.ТабличныеЧасти.НачисленныеПроцентыПоЗаймам.Реквизиты;
	Для Каждого Реквизит Из Реквизиты Цикл
		НачисленныеПроцентыПоЗаймам.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип);
	КонецЦикла;
	
	Результат = Новый Структура();
	Результат.Вставить("НачисленнаяЗарплатаИВзносы",           НачисленнаяЗарплатаИВзносы);
	Результат.Вставить("НачисленнаяЗарплатаИВзносыПоФизлицам", НачисленнаяЗарплатаИВзносыПоФизлицам);
	Результат.Вставить("НачисленныйНДФЛ",                      НачисленныйНДФЛ);
	Результат.Вставить("УдержаннаяЗарплата",                   УдержаннаяЗарплата);
	Результат.Вставить("НачисленныеПроцентыПоЗаймам",          НачисленныеПроцентыПоЗаймам);
	
	Возврат Результат;
	
КонецФункции

Процедура НастроитьСоставКолонок(НастройкиКомпоновкиДанных)
	
	ДатаОтменыТФОМС = УчетСтраховыхВзносовКлиентСервер.ДатаОтменыТФОМС();
	ДатаОбъединенияСтраховойИНакопительной = УчетСтраховыхВзносовКлиентСервер.ДатаОбъединенияСтраховойИНакопительнойЧастейВзносовПФР();
	ДатаПоявленияВзносовНаДоплатуШахтерам = УчетСтраховыхВзносовКлиентСервер.ДатаВводаВзносовНаДоплатуШахтерам();
	ДатаПоявленияВзносовТяжВред = УчетСтраховыхВзносовКлиентСервер.ДатаВводаВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией();
	
	НеиспользуемыеПоля = Новый Массив;
	
	Если НачалоПериода >= ДатаОтменыТФОМС Тогда
		НеиспользуемыеПоля.Добавить(Новый ПолеКомпоновкиДанных("ТФОМС"));
		НеиспользуемыеПоля.Добавить(Новый ПолеКомпоновкиДанных("ТФОМСКОтражению"));
	КонецЕсли;
	
	Если НачалоПериода >= ДатаОбъединенияСтраховойИНакопительной Тогда
		НеиспользуемыеПоля.Добавить(Новый ПолеКомпоновкиДанных("ПФРСтраховая"));
		НеиспользуемыеПоля.Добавить(Новый ПолеКомпоновкиДанных("ПФРСтраховаяКОтражению"));
		НеиспользуемыеПоля.Добавить(Новый ПолеКомпоновкиДанных("ПФРНакопительная"));
		НеиспользуемыеПоля.Добавить(Новый ПолеКомпоновкиДанных("ПФРНакопительнаяКОтражению"));
	КонецЕсли;
	
	Если НачалоПериода < ДатаОбъединенияСтраховойИНакопительной Тогда
		НеиспользуемыеПоля.Добавить(Новый ПолеКомпоновкиДанных("ПФРПоСуммарномуТарифу"));
		НеиспользуемыеПоля.Добавить(Новый ПолеКомпоновкиДанных("ПФРПоСуммарномуТарифуКОтражению"));
	КонецЕсли;
	
	Если НачалоПериода < ДатаПоявленияВзносовНаДоплатуШахтерам Или Не ПолучитьФункциональнуюОпцию("ИспользуетсяТрудШахтеров") Тогда
		НеиспользуемыеПоля.Добавить(Новый ПолеКомпоновкиДанных("ПФРНаДоплатуШахтерам"));
		НеиспользуемыеПоля.Добавить(Новый ПолеКомпоновкиДанных("ПФРНаДоплатуШахтерамКОтражению"));
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользуетсяТрудЧленовЛетныхЭкипажей") Тогда
		НеиспользуемыеПоля.Добавить(Новый ПолеКомпоновкиДанных("ПФРНаДоплатуЛетчикам"));
		НеиспользуемыеПоля.Добавить(Новый ПолеКомпоновкиДанных("ПФРНаДоплатуЛетчикамКОтражению"));
	КонецЕсли;

	Если НачалоПериода < ДатаПоявленияВзносовТяжВред Или Не ПолучитьФункциональнуюОпцию("ИспользуютсяРаботыСДосрочнойПенсией") Тогда
		НеиспользуемыеПоля.Добавить(Новый ПолеКомпоновкиДанных("ПФРЗаЗанятыхНаПодземныхИВредныхРаботах"));
		НеиспользуемыеПоля.Добавить(Новый ПолеКомпоновкиДанных("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахКОтражению"));
		НеиспользуемыеПоля.Добавить(Новый ПолеКомпоновкиДанных("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах"));
		НеиспользуемыеПоля.Добавить(Новый ПолеКомпоновкиДанных("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахКОтражению"));
	КонецЕсли;
	
	МассивПолей = Новый Массив;
	
	Для Каждого ЭлементСтруктуры Из НастройкиКомпоновкиДанных.Структура Цикл
		
		ДобавитьВыбранныеПоляВМассив(
			ЭлементСтруктуры.Выбор.Элементы,
			МассивПолей,
			Ложь);
		
	КонецЦикла;
	
	Для Каждого ВыбранноеПоле Из МассивПолей Цикл
		
		Если НеиспользуемыеПоля.Найти(ВыбранноеПоле.Поле) <> Неопределено Тогда
			ВыбранноеПоле.Использование = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьВыбранныеПоляВМассив(ЭлементСтруктуры, МассивПолей, ТолькоГруппы = Ложь)
	
	Если ТипЗнч(ЭлементСтруктуры) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		ВыбранныеПоля = ЭлементСтруктуры.Настройки.Выбор;
	Иначе
		ВыбранныеПоля = ЭлементСтруктуры;
	КонецЕсли;
	
	Для каждого Элемент Из ЭлементСтруктуры Цикл
		Если ТипЗнч(Элемент) = Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
			Продолжить;
		ИначеЕсли ТипЗнч(Элемент) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			Если ТолькоГруппы Тогда
				МассивПолей.Добавить(Элемент);
			КонецЕсли;
			ДобавитьВыбранныеПоляВМассив(Элемент.Элементы, МассивПолей, ТолькоГруппы);
		Иначе
			Если Не ТолькоГруппы Тогда
				МассивПолей.Добавить(Элемент);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
